Revit 2024 API
ExportPatternTable.Remove Method
 Removes the pair (key, info) by pattern key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void Remove(
	ExportPatternKey exportPatternKey
)
Visual Basic
Public Sub Remove ( _
	exportPatternKey As ExportPatternKey _
)
Visual C++
public:
void Remove(
	ExportPatternKey^ exportPatternKey
)
Parameters
exportPatternKey
Type: Autodesk.Revit.DB.ExportPatternKey
 The export pattern key.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace